Revit 2024 API
FamilyThermalProperties.IsValid Method
 Confirms that the thermal properties are correctly set for assignment to a FamilySymbol.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public bool IsValid()
Visual Basic
Public Function IsValid As Boolean
Visual C++
public:
bool IsValid()
Return Value
 True if the thermal properties are valid, false otherwise.
See Also
FamilyThermalProperties Class
Autodesk.Revit.DB Namespace